j20-immigration/j20-immigration.org
#+OPTIONS: broken-links:t todo:nil
#+AUTHOR: Hawaii J20
#+hugo_base_dir: /home/dk/Public/projects/958-web-site/public-node/j20-immigration/
#+hugo_auto_set_lastmod: t
** Aren't undocumented immigrants a drain on our social services?
   :PROPERTIES:
   :EXPORT_FILE_NAME: social-services
   :EXPORT_DATE: 2018-06-12
   :EXPORT_AUTHOR: "Hawaii J20"
   :EXPORT_HUGO_MENU: :menu "main"
   :END:

*** Question
Illegal aliens are a drain on our communities because they get welfare
and free health care, so why shouldn’t they be deported?

*** Answer
Undocumented immigrants support government financially because they pay
taxes. Yet they do not qualify for the most costly government assistance
programs, such as Social Security, Medicare, and Medicaid, although they may
qualify for some smaller government assistance programs. Studies show that
undocumented immigrants pay about as much in taxes as they receive in government
programs.

