j20-immigration/content/post/social-services.md
+++
title = "Aren't undocumented immigrants a drain on our social services?"
author = ["Hawaii J20"]
date = 2018-06-12
lastmod = 2018-06-13T14:11:31-10:00
draft = false
[menu.main]
  weight = 2009
  identifier = "aren-t-undocumented-immigrants-a-drain-on-our-social-services"
+++

## Question {#question}

Illegal aliens are a drain on our communities because they get welfare
and free health care, so why shouldn’t they be deported?


## Answer {#answer}

Undocumented immigrants support government financially because they pay
taxes. Yet they do not qualify for the most costly government assistance
programs, such as Social Security, Medicare, and Medicaid, although they may
qualify for some smaller government assistance programs. Studies show that
undocumented immigrants pay about as much in taxes as they receive in government
programs.
